/*Попрактикуемся в использовании CROSS JOIN. Ваша задача — реализовать столбец rank, который назначает порядок числу из числового столбца.
Пример ниже. Данную задачу часто дают на собеседованиях. Она решается через CROSS JOIN и GROUP BY. Пользоваться массивами или оконными функциями в данном задании нельзя.
СУБД CLICKHOUSE
Скрипт для генерации данных

CREATE TABLE cross_join
(
    user UInt64,
    value UInt64
)
ENGINE = Log

INSERT INTO cross_join (*) VALUES (50, 136),  (16, 188),  (42, 190),  (92, 106),  (61, 173),  (96, 192),  (30, 182),  (71, 179),  (48, 160),  (31, 103),  (74, 178),  (27, 102),  (77, 105),  (62, 120),  (84, 177),  (49, 164),
(70, 184),  (46, 145),  (17, 100),  (39, 114),  (55, 121),  (87, 123),  (68, 119),  (58, 115),  (85, 122),  (69, 148),  (75, 175),  (18, 101),  (22, 158),  (43, 104),  (0, 162),  (97, 163),  (6, 131),  (78, 128),  (59, 159),
(37, 156),  (40, 107),  (2, 194),  (11, 134),  (8, 189),  (83, 187),  (7, 197),  (64, 111),  (1, 117),  (79, 161),  (21, 110),  (76, 109),  (60, 170),  (57, 191),  (54, 108),  (13, 139),  (80, 125),  (35, 129),  (82, 171),
(89, 153),  (66, 174),  (95, 135),  (41, 193),  (15, 141),  (81, 127),  (24, 181),  (36, 146),  (34, 142),  (67, 143),  (53, 140),  (93, 113),  (44, 149),  (26, 198),  (19, 138),  (63, 147),  (32, 186),  (88, 180),  (20, 172),
(29, 151),  (5, 169),  (73, 124),  (25, 185),  (72, 183),  (3, 154),  (14, 118),  (9, 133),  (52, 112),
(45, 199),  (4, 132),  (98, 144),  (38, 152),  (10, 157),  (65, 165),  (90, 176),  (47, 137),  (12, 116),  (28, 168),  (33, 130),  (94, 167),  (23, 166),  (56, 196),  (99, 195),  (51, 150),  (86, 126),  (91, 155)*/
with t1 as (select cj.user,cj.value,count(*) as c  from cross_join cj 
cross join cross_join cj2 
where cj.value<=cj2.value
group by cj.user,cj.value
order by value desc )
select sum(value * c) from t1
